[
    {
        "Course ID": "CYB 101",
        "Course Name": " Introduction to Cybersecurity",
        "Credit Hours": "3",
        "Course Description": "An introductory study focused on designing and implementing best practices for protecting critical business and governmental assets and infrastructure. Thic course will identify the importance of cybersecurity within an organization and explain the role of cybersecurity professionals. Students will be introduced to current cybersecurity technologies and procedures with an emphasis on cyber threat and intrusion mitigation strategies.",
        "Prerequisite": "",
        "Semester Offered": "Fall",
        "Category": "CYB",
        "Subcategory": "CYB Core"
    },
    {
        "Course ID": "CYB 201",
        "Course Name": "Introduction to Linux",
        "Credit Hours": "3",
        "Course Description": "An introductory study focused on several flavors of the Linux desktop operating system. Basic\r\ncommands, utilities, system structures, scripting, and tools will be explored along with system\r\nadministration tools and techniques. This course will include a focus on securing the Linux desktop.",
        "Prerequisite": "",
        "Semester Offered": "Spring",
        "Category": "CYB",
        "Subcategory": "CYB Core"
    },
    {
        "Course ID": "CYB 220",
        "Course Name": "Windows Security",
        "Credit Hours": "3",
        "Course Description": "An introductory study focused on the Windows desktop operating system. The main emphasis will be on Windows 10. Basic commands, utilities, system structures, scripting, and tools will be explored along with system administration tools and techniques. This course will include a focus on securing the Windows desktop",
        "Prerequisite": "",
        "Semester Offered": "Fall",
        "Category": "CYB",
        "Subcategory": "CYB Core"
    },
    {
        "Course ID": "CYB 350",
        "Course Name": "Ethical Hacking",
        "Credit Hours": "3",
        "Course Description": "An in-depth study of the science of ethical hacking. In this class, the student will be immersed in ethical hacking techniques including hands-on exercise. This detailed study will discuss perimeter security giving students the opportunity to scan and attack a test laboratory network. While performing penetration tests, students will participate in this course offering adhering to the highest ethical and moral standards. ",
        "Prerequisite": "CYB 101, CYB 201, CYB 220",
        "Semester Offered": "Spring Even",
        "Category": "CYB",
        "Subcategory": "CYB Core"
    },
    {
        "Course ID": "CYB 380",
        "Course Name": "Cybersecurity Planning and Risk Management (W)",
        "Credit Hours": "3",
        "Course Description": "An in-depth study of enterprise cybersecurity planning and implementation including risk management, business continuity, and disaster recovery. The student will analyze and evaluate both internal and external cybersecurity threats and learn to perform risk mitigation assessments utilizing industry best practices. ",
        "Prerequisite": "CYB 101 ",
        "Semester Offered": "Fall Even",
        "Category": "CYB",
        "Subcategory": "CYB Core"
    },
    {
        "Course ID": "CYB 390",
        "Course Name": "Network Administration and Security",
        "Credit Hours": "3",
        "Course Description": "A focused study introducing the student to fundamental network security concepts, architectures, and protocols as related to network security. Cybersecurity policies, technical controls, current best practice guidelines, tools, and administration will be discussed as pertaining to the enterprise network environment. ",
        "Prerequisite": "CYB 101, CYB 220, CIS 345",
        "Semester Offered": "Fall",
        "Category": "CYB",
        "Subcategory": "CYB Core"
    },
    {
        "Course ID": "CYB 410",
        "Course Name": "Digital Forensics and Incident Response (W)",
        "Credit Hours": "3",
        "Course Description": "An in-depth study of the science of digital forensics. This course provides hands-on exposure to digital forensics and incident response techniques used within an enterprise environment. Topics discussed will include cybercrimes, network intrusions, insider threats, employee technology misuse, forensic artifacts, forensic imaging, and using investigative forensic tools. A hands-on laboratory is included. ",
        "Prerequisite": "CYB 101, CYB 201, CYB 220",
        "Semester Offered": "Fall Odd",
        "Category": "CYB",
        "Subcategory": "CYB Core"
    },
    {
        "Course ID": "CYB 430",
        "Course Name": "Intrusion Detection and Mitigation",
        "Credit Hours": "3",
        "Course Description": "An in-depth study of network perimeter security focusing on threats, network intrusions, mitigation efforts, and prevention. The student will be introduced to current intrusion detection methods focusing on intrusion detection tools, network traffic/packet analysis, and interpretation of intrusion detection anomalies.",
        "Prerequisite": "CYB 201, CYB 390",
        "Semester Offered": "Spring Odd",
        "Category": "CYB",
        "Subcategory": "CYB Core"
    },
    {
        "Course ID": "CYB 440",
        "Course Name": "Cryptography",
        "Credit Hours": "3",
        "Course Description": "An introduction to the basic theory and practice of cryptographic techniques used in cybersecurity. Topics include encryption (symmetric and asymmetric), message integrity, digital signatures, use authentication, key management, cryptographic hashing, common cryptographic protocols, and attacks on cryptographic techniques.",
        "Prerequisite": "CIS 172, MAT 101 or higher",
        "Semester Offered": "Spring Even",
        "Category": "CYB",
        "Subcategory": "CYB Core"
    },
    {
        "Course ID": "CYB 495",
        "Course Name": "Cybersecurity Capstone (W)",
        "Credit Hours": "3",
        "Course Description": "This capstone experience should be taken during the last year of study of the cybersecurity major. The student will produce an individual project dealing with an approved cybersecurity topic. This work will be an original contribution of the student demonstrating a comprehensive knowledge of cybersecurity theory and operating practice.",
        "Prerequisite": "CYB 390, senior standing",
        "Semester Offered": "Spring",
        "Category": "CYB",
        "Subcategory": "CYB Core"
    },
    {
        "Course ID": "CIS 171",
        "Course Name": "Computer Programming I",
        "Credit Hours": "3",
        "Course Description": "A study of the design of algorithms, pseudocode, data types, control structures, arrays, program testing, and text file processing using a high level programming language.",
        "Prerequisite": "",
        "Semester Offered": "Fall",
        "Category": "CYB",
        "Subcategory": "CIS Core"
    },
    {
        "Course ID": "CIS 172",
        "Course Name": "Computer Programming II",
        "Credit Hours": "3",
        "Course Description": "A continuation of CIS 171. Emphasis is on object-oriented constructs and techniques, generics, and use of common data structures supported by the language.",
        "Prerequisite": "CIS 171",
        "Semester Offered": "Spring",
        "Category": "CYB",
        "Subcategory": "CIS Core"
    },
    {
        "Course ID": "CIS 273",
        "Course Name": "Data Structures",
        "Credit Hours": "3",
        "Course Description": "A continuation of CIS 172. A study of the use of data structures in the design and implementation of software. Topics may include linked lists, stacks, queues, and trees, and their proper application.",
        "Prerequisite": "CIS 172",
        "Semester Offered": "Fall",
        "Category": "CYB",
        "Subcategory": "CIS Core"
    },
    {
        "Course ID": "CIS 324",
        "Course Name": "Database Systems",
        "Credit Hours": "3",
        "Course Description": "A study of the major data models with emphasis on relational systems. Topics include database design, database implementation, database processing, and security. Project work will include creating and modifying databases using Structured Query Language (SQL) and Query By Example (QBE). Current commercial databases will also be studied.",
        "Prerequisite": "CIS 172",
        "Semester Offered": "Fall",
        "Category": "CYB",
        "Subcategory": "CIS Core"
    },
    {
        "Course ID": "CIS 345",
        "Course Name": "Computer Networks",
        "Credit Hours": "3",
        "Course Description": "An overview of computer networking principles and practices. Topics include networking theory, layered protocols, Internet addressing, network topologies, network architectures, and network implementation.",
        "Prerequisite": "MAT 101 or higher",
        "Semester Offered": "Spring",
        "Category": "CYB",
        "Subcategory": "CIS Core"
    },
    {
        "Course ID": "CIS 441",
        "Course Name": "System Admin and Security",
        "Credit Hours": "3",
        "Course Description": "A study of the configuration, administration, maintenance, and tuning of network servers using current operating systems and hardware. Securing the system from internal and external threats is emphasized throughout the course. ",
        "Prerequisite": "CIS 345",
        "Semester Offered": "Fall Even",
        "Category": "CYB",
        "Subcategory": "CIS Core"
    },
    {
        "Course ID": "CIS 460",
        "Course Name": "Operating Systems",
        "Credit Hours": "3",
        "Course Description": "Principles of design and operation of computer operating systems. Topics include processes, threads, memory management, scheduling, file systems, input and output, concurrency, and performance. ",
        "Prerequisite": "CIS 172",
        "Semester Offered": "Spring Odd",
        "Category": "CYB",
        "Subcategory": "CIS Core"
    }
]